# ДАННЫЙ ПРИМЕР УСТАНИВЛИВАЕТ СВЕТОДИОДНУЮ АНИМАЦИЮ НАЖАТИЙ КНОПОК:#
# (нажимайте удерживайте и отпускайте кнопки клавиатуры)           #
                                                                   #
from pyiArduinoI2Ckeyboard import *                                #   Подключаем библиотеку для работы с клавиатурой I2C-flash.
kbd = pyiArduinoI2Ckeyboard(0x09,4,2)                              #   Объявляем объект kbd для работы с функциями и методами библиотеки pyiArduinoI2Ckeyboard, указывая адрес модуля на шине I2C, количество кнопок в линии, количество линий с кнопками.
                                                                   #   Если объявить объект без указания адреса (pyiArduinoI2Ckeyboard kbd(false,4,2) ), то адрес будет найден автоматически.
#  Включаем одну из представленных анимаций:                       #
#  kbd.setAnimation(1,200)                                         #   Анимация №1: Светодиод будет включаться на 200 мс после каждого нажатия на кнопку.
#  kbd.setAnimation(2,200)                                         #   Анимация №2: Светодиод будет включаться на 200 мс после каждого отпускания кнопки.
#  kbd.setAnimation(3,200)                                         #   Анимация №3: Светодиод будет включаться на 200 мс после каждого нажатия или отпускания кнопки.
#  kbd.setAnimation(4)                                             #   Анимация №4: Светодиод будет светиться пока кнопка нажата.
#  kbd.setAnimation(5)                                             #   Анимация №5: Светодиод работает как переключатель.
#  kbd.setAnimation(6)                                             #   Анимация №6: Светодиод будет светиться если кнопка удерживается (нажата дольше 0,5 с).
kbd.setAnimation(7)                                                #   Анимация №7: Светодиод будет светиться при каждом пополнении буфера FIFO кодом символа своей кнопки.
#  kbd.setAnimation(0)                                             #   Отключить светодиодную анимацию.
                                                                   #
#  ПРИМЕЧАНИЕ:                                                     #
#  Светодиодная анимация выполняется модулем клавиатуры,           #
#  не используя ресурсов системы.                                  #
#  Для некоторых видов анимации можно (но не обязательно)          #
#  указывать время свечения светодиода (от 0 до 2550 мс).          #
