# ДАННЫЙ ПРИМЕР УПРАВЛЯЕТ ЯРКОСТЬЮ СВЕТОДИОДОВ:                     #
                                                                    #
from pyiArduinoI2Ckeyboard import *                                 #   Подключаем библиотеку для работы с клавиатурой I2C-flash.
kbd = pyiArduinoI2Ckeyboard(0x09,4,2)                                 #   Объявляем объект kbd для работы с функциями и методами библиотеки pyiArduinoI2Ckeyboard, указывая адрес модуля на шине I2C, количество кнопок в линии, количество линий с кнопками.
                                                                    #   Если объявить объект без указания адреса (pyiArduinoI2Ckeyboard kbd(false,4,2) ), то адрес будет найден автоматически.
kbd.setLight( 7 )                                                   #   Устанавливаем максимальную яркость свечения светодиодов.
kbd.setLed(KEY_ALL,0b11111111)                                      #   Включаем все светодиоды.
                                                                    #
                                                                    #
#  ПРИМЕЧАНИЕ:                                                      #
#  Яркость светодиодов, устанавливаемая функцией setLight()         #
#  сохраняется в энергонезависимой памяти модуля клавиатуры.        #
#  Не используйте функию setLight() в циклах.                       #
